def 加法(x,y):
    return x + y
def 減法(x,y):
    return x - y
def 乘法(x,y):
    return x * y
def 除法(x,y):
    商數 = x // y
    餘數 = x % y
    return 商數, 餘數

while True:
    計算方式 = input("請輸入欲計算的方式: (1)加法 (2)減法 (3) 乘法(4)除法 (或按任意鍵關閉程式)")
    if 計算方式 in ("1", "2", "3", "4"):
        數字1 = int(input("請輸入第一個整數: "))
        數字2 = int(input("請輸入第二個整數: "))
        if 計算方式 == "1":
            print(f"{數字1} 加 {數字2} 等於 {加法(數字1,數字2)}")
        elif 計算方式 == "2":
            print(f"{數字1} 減 {數字2} 等於 {減法(數字1,數字2)}")
        elif 計算方式 == "3":
            print(f"{數字1} 乘 {數字2} 等於 {乘法(數字1,數字2)}")
        elif 計算方式 == "4":
            if 數字1 % 數字2 == 0:
                print(f"{數字1} 除 {數字2} 等於 {除法(數字1,數字2)[0]}")
            else:
                print(f"{數字1} 除 {數字2} 等於 {除法(數字1,數字2)[0]} 餘 {除法(數字1,數字2)[1]}")
    else:
        print("選項錯誤!!")
        break