手機1  ={
    "廠牌" : "蘋果",
    "型號" : "Iphone 14 Pro ",
    "容量" : "256GB",
    "顏色" : "深紫色"   
}
手機2  ={
    "廠牌" : "小米",
    "型號" : "Iphone 12 Pro 5G ",
    "容量" : "256GB",
    "顏色" : "白色"   
}
手機3  ={
    "廠牌" : "三星",
    "型號" : "Galaxy S22 Ultra ",
    "容量" : "256GB",
    "顏色" : "黑色"   
}
庫存 = [手機1, 手機2, 手機3]
查詢 = input("請輸入要查詢廠牌的名稱: ")
if 查詢 in str(庫存):
    for a in 庫存:
        if a["廠牌"] == 查詢:
            print(f"目前庫存中有{a['顏色']}的{a['型號']}，容量是{a['容量']}")
else:
    print(f"{查詢}目前無庫存")
#a = 手機 